#include <stdio.h>

int isInsideTriangle(int x, int y, int x1, int y1, int x2, int y2, int x3, int y3) {
    // Обчислюємо векторні добутки
    int v1 = (x3 - x1) * (y - y1) - (x - x1) * (y3 - y1);
    int v2 = (x2 - x1) * (y - y1) - (x - x1) * (y2 - y1);
    int v3 = (x3 - x2) * (y - y2) - (x - x2) * (y3 - y2);
    
    // Перевіряємо знаки векторних добутків
    if ((v1 >= 0 && v2 >= 0 && v3 >= 0) || (v1 <= 0 && v2 <= 0 && v3 <= 0)) {
        return 1; // Точка знаходиться всередині трикутника
    } else {
        return 0; // Точка знаходиться ззовні трикутника
    }
}

int main() {
    int x, y, x1, y1, x2, y2, x3, y3;
    printf("Введіть координати точки (x, y): ");
    scanf("%d %d", &x, &y);
    printf("Введіть координати головної вершини трикутника (x1, y1): ");
    scanf("%d %d", &x1, &y1);
    printf("Введіть координати другої вершини трикутника (x2, y2): ");
    scanf("%d %d", &x2, &y2);
    printf("Введіть координати третьої вершини трикутника (x3, y3): ");
    scanf("%d %d", &x3, &y3);
    
    if (isInsideTriangle(x, y, x1, y1, x2, y2, x3, y3)) {
        printf("Точка знаходиться всередині трикутника");
    } else {
        printf("Точка знаходиться ззовні трикутника");
    }
    
    return 0;
}
